# Project Solution - Primary

You have to work on the [Kiva](https://drive.google.com/file/d/1-tJtnIbo1Rt-F1XfoWGVkmBXiI-ciuRx/view) dataset. Some information on the datasets are on the [Kaggle](https://www.kaggle.com/gaborfodor/additional-kiva-snapshot) web page.

## Basic tasks

**1.** Normalize the `loan_lenders` table. In the normalized table, each row must have one `loan_id` and one `lender`.

Firstly, csv file is read and data frame with unnormalized data is created:

In [1]:
import pandas as pd
import numpy as np
import time as tm
FINAL = False # This is final calculation, on complete data
start_time = tm.time()
loans_lenders_un = pd.read_csv('../../Datasets/kiva/loans_lenders.csv')
if not FINAL:
    loans_lenders_un = loans_lenders_un.head(10000) 
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_lenders_un

--- 3.241013526916504 seconds ---

      loan_id                                            lenders
0      483693  muc888, sam4326, camaran3922, lachheb1865, reb...
1      483738  muc888, nora3555, williammanashi, barbara5610,...
2      485000  muc888, terrystl, richardandsusan8352, sherri4...
3      486087  muc888, james5068, rudi5955, daniel9859, don92...
4      534428  muc888, niki3008, teresa9174, mike4896, david7...
...       ...                                                ...
9995    45940  helga4707, james6963, jimjams, andreas2382, si...
9996   247491  priyaram, christian9832, john9242, sandra1434,...
9997   345274  priyaram, nicola1093, bobby9744, simon7848, di...
9998   125945  joseph1859, matt5349, reese3555, stanley3312, ...
9999   225434  michael25572458, tom8330, garyk, manas8925, ma...

[10000 rows x 2 columns]

Data frame with structured data will be created with help of intermediate object - list of pairs (loan_id, lender) packed in the dictionary:

In [2]:
import time as tm
start_time = tm.time()
lis = []
for index, row in loans_lenders_un.iterrows(): 
    ls = row['lenders'].split(',')
    for l in ls:
        lis.append({ 'loan_id' : row['loan_id'], 'lender': l.strip() })
loans_lender = pd.DataFrame(lis) 
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_lender

--- 2.3199539184570312 seconds ---

        loan_id             lender
0        483693             muc888
1        483693            sam4326
2        483693        camaran3922
3        483693        lachheb1865
4        483693        rebecca3499
...         ...                ...
245000   225434       wongacom3393
245001   225434  marleneanddel8151
245002   225434         joanne4956
245003   225434         juddie7070
245004   225434          keith7215

[245005 rows x 2 columns]

**2.** For each loan, add a column `duration` corresponding to the number of days between the disburse time and the planned expiration time. If any of those two dates is missing, also the duration must be missing.

Firstly, data frame should be loaded and structure of the data frame `loans` should be determined:

In [3]:
import pandas as pd
import numpy as np
import time as tm
start_time = tm.time()
loans = pd.read_csv('../../Datasets/kiva/loans.csv')
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans.columns

--- 23.509063243865967 seconds ---

Index(['loan_id', 'loan_name', 'original_language', 'description',
       'description_translated', 'funded_amount', 'loan_amount', 'status',
       'activity_name', 'sector_name', 'loan_use', 'country_code',
       'country_name', 'town_name', 'currency_policy',
       'currency_exchange_coverage_rate', 'currency', 'partner_id',
       'posted_time', 'planned_expiration_time', 'disburse_time',
       'raised_time', 'lender_term', 'num_lenders_total',
       'num_journal_entries', 'num_bulk_entries', 'tags', 'borrower_genders',
       'borrower_pictured', 'repayment_interval', 'distribution_model'],
      dtype='object')

After thar, values from the data frame should be displayed:

In [4]:
if not FINAL:
    loans = loans.head(20000)
loans

,loan_id,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,...,raised_time,lender_term,num_lenders_total,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model
0,657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0,125.0,funded,General Store,Retail,...,2014-01-15 04:48:22.000 +0000,7.0,3,2,1,NaN,female,true,irregular,field_partner
1,657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0,400.0,funded,Used Clothing,Clothing,...,2014-02-25 06:42:06.000 +0000,8.0,11,2,1,NaN,female,true,monthly,field_partner
2,658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0,400.0,funded,General Store,Retail,...,2014-01-24 23:06:18.000 +0000,14.0,16,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner
3,659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0,625.0,funded,Farming,Agriculture,...,2014-01-22 05:29:28.000 +0000,14.0,21,2,1,user_favorite,female,true,monthly,field_partner
4,656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0,425.0,funded,Farming,Agriculture,...,2014-01-14 17:29:27.000 +0000,7.0,15,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19995,341198,Guillermo Antonio,Spanish,"El Señor Guillermo tiene 42 años, la ubicación...",Guillermo is 42 years old. His business is lo...,375.0,375.0,funded,Shoe Sales,Retail,...,2011-10-13 00:00:41.000 +0000,14.0,10,1,1,NaN,male,true,monthly,field_partner
19996,341771,ERLINDA,English,Erlinda is from the village of Sillawit. She i...,NaN,175.0,175.0,funded,General Store,Retail,...,2011-10-14 06:02:23.000 +0000,8.0,3,2,1,NaN,female,true,irregular,field_partner
19997,344237,Ma Guadalupe,Spanish,La señora Ma Guadalupe es madre de 2 hijos de ...,\r\nMaría Guadalupe is the mother of two child...,625.0,625.0,funded,Property,Housing,...,2011-10-27 19:23:44.000 +0000,14.0,23,1,1,NaN,female,true,monthly,field_partner
19998,344735,Blanca Lidia,Spanish,"Blanca, vive con su esposo, tiene tres hijos d...",Blanca lives with her husband and has three ch...,350.0,350.0,funded,Food Production/Sales,Food,...,2011-10-12 02:10:27.000 +0000,8.0,10,4,2,NaN,female,true,monthly,field_partner
19999,345313,Jackline,English,"Jackline is 30 years old, married, and a moth...",NaN,100.0,100.0,funded,Clothing,Clothing,...,2011-10-17 14:35:09.000 +0000,8.0,1,1,1,NaN,female,true,monthly,field_partner

We are now mainly interested in columns 'planned_expiration_time', 'disburse_time':

In [5]:
loans_sel = loans[ ['loan_id', 'loan_name','planned_expiration_time', 'disburse_time'] ]
loans_sel

,loan_id,loan_name,planned_expiration_time,disburse_time
0,657307,Aivy,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000
1,657259,Idalia Marizza,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000
2,658010,Aasia,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000
3,659347,Gulmira,2014-02-21 03:10:02.000 +0000,2014-01-17 08:00:00.000 +0000
4,656933,Ricky\t,2014-02-13 06:10:02.000 +0000,2013-12-17 08:00:00.000 +0000
...,...,...,...,...
19995,341198,Guillermo Antonio,NaN,2011-09-13 07:00:00.000 +0000
19996,341771,ERLINDA,NaN,2011-09-16 07:00:00.000 +0000
19997,344237,Ma Guadalupe,NaN,2011-10-07 07:00:00.000 +0000
19998,344735,Blanca Lidia,NaN,2011-09-16 07:00:00.000 +0000
19999,345313,Jackline,NaN,2011-09-23 07:00:00.000 +0000

In [6]:
from datetime import datetime as dt
import time as tm
start_time = tm.time()
loans['duration'] = None
for index, row in loans.iterrows(): 
    s2 = row['planned_expiration_time']
    s1 = row['disburse_time']
    if( pd.notna(s1) and pd.notna(s2) and s1 != '' and s2 != ''):
        d2 = dt.strptime(s2, "%Y-%m-%d %H:%M:%S.%f %z")
        d1 = dt.strptime(s1, "%Y-%m-%d %H:%M:%S.%f %z")
        loans.loc[index,'duration'] = (d2 - d1).days 
loans_sel = loans[ ['loan_id', 'loan_name','planned_expiration_time', 'disburse_time', 'duration'] ]
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_sel

--- 12.306546926498413 seconds ---

,loan_id,loan_name,planned_expiration_time,disburse_time,duration
0,657307,Aivy,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000,53
1,657259,Idalia Marizza,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000,96
2,658010,Aasia,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000,37
3,659347,Gulmira,2014-02-21 03:10:02.000 +0000,2014-01-17 08:00:00.000 +0000,34
4,656933,Ricky\t,2014-02-13 06:10:02.000 +0000,2013-12-17 08:00:00.000 +0000,57
...,...,...,...,...,...
19995,341198,Guillermo Antonio,NaN,2011-09-13 07:00:00.000 +0000,None
19996,341771,ERLINDA,NaN,2011-09-16 07:00:00.000 +0000,None
19997,344237,Ma Guadalupe,NaN,2011-10-07 07:00:00.000 +0000,None
19998,344735,Blanca Lidia,NaN,2011-09-16 07:00:00.000 +0000,None
19999,345313,Jackline,NaN,2011-09-23 07:00:00.000 +0000,None

**3.** Find the lenders that have funded at least twice.

- Those are lenders that are duplicated in structured loan_leneders dataframe.

This solution is based on panda functionality:

In [7]:
import time as tm
start_time = tm.time()
loans_lender_2_more = loans_lender[loans_lender.duplicated(['lender'])]
lenders_funded_2_more = list(set(loans_lender_2_more['lender']))
print("--- %s seconds ---" % (tm.time()-start_time)) 
lenders_funded_2_more

--- 0.08571314811706543 seconds ---

['anton4531',
 'jared6467',
 'susanianandnicky8425',
 'le9393',
 'doug1225',
 'lisa9511',
 'zbicyclist',
 'reg4900',
 'faith1865',
 'mark3485',
 'kenandlani1824',
 'christia6303',
 'matt50679987',
 'sal5571',
 'mioscu',
 'carl8200',
 'karen9880',
 'bepe86',
 'constance3959',
 'angelo4036',
 'paul11194045',
 'patrick79503482',
 'charlie5840',
 'patrikmalmquist',
 'zawadi8552',
 'matti4851',
 'june9313',
 'reid7395',
 'lottekato',
 'christiane7722',
 'james1247',
 'nicky8878',
 'lana3073',
 'antoine7223',
 'gunhild2246',
 'camperofamily4268',
 'robelyemiru',
 'harold4520',
 'soumangue6100',
 'anita4777',
 'proxieme',
 'amy3882',
 '4feet2mouths',
 'queena',
 'christopher92733593',
 'glenn8808',
 'trish7207',
 'david15503009',
 'roman9387',
 'jadie7093',
 'udo2238',
 'joel7001',
 'mary2445',
 'patrick5137',
 'joan3035',
 'sarah61944288',
 'todd7797',
 'floorbread',
 'karen3790',
 'rod4750',
 'LovelaceGroup4223',
 'jochen9594',
 'leena6056',
 'reto8267',
 'alison2479',
 'simon9510',
 'arjenbriene',
 'gianluca9938',
 'larry5803',
 'duda6666',
 'martha6525',
 'edward4696',
 'keith4234',
 'lydia2033',
 'jessica7791',
 'rudy5028',
 'massimiliano8952',
 'janis8712',
 'martha9969',
 'sharon30204647',
 'suresh4800',
 'john2730',
 'lachlan8690',
 'jeffrey5246',
 'sarah1750',
 'kerry4093',
 'dianne3645',
 'karen7462',
 'jochen6758',
 'dutch7942',
 'julie3027',
 'karen8141',
 'corina1092',
 'chuck4776',
 'lauraltonhall',
 'sharon7084',
 'david64733741',
 'dave74191981',
 'najat5066',
 'kristin9745',
 'adele8372',
 'john6695',
 'yeohkt',
 'ArthurA',
 'brian7094',
 'marc2143',
 'dennis5915',
 'ruth79201822',
 'andrea8425',
 'gregory5162',
 'ross3932',
 'JanUitLeiden',
 'ck0913',
 'cornelia4380',
 'sveinn2937',
 'julie8037',
 'etienne5477',
 'hans7665',
 'fred8065',
 'melanieandjustin9247',
 'giovanni4750',
 'lindsay4404',
 'david6732',
 'cheryl6370',
 'murray5846',
 'marc3881',
 'maurice2828',
 'sergio2824',
 'christian4060',
 'helen6680',
 'marianne4842',
 'andyonkiva',
 'lachlan2210',
 'janis5258',
 'oli6332',
 'sarah68132485',
 'keith7047',
 'valentin7833',
 'kimmo1672',
 'alex15256029',
 'areef7365',
 'fred7284',
 'emills',
 'sysboy',
 'johanna4020',
 'melody1740',
 'michaelb1681',
 'andrebolhuis82',
 'tom9213',
 'doug4824',
 'andrew4775',
 'surajshrutika8957',
 'michael46177363',
 'kenji5098',
 'carolyne4054',
 'hopeesq',
 'griet2766',
 'elias7154',
 'william1019',
 'rsriprac',
 'alex3212',
 'robert59061674',
 'lisa6575',
 'susan3403',
 'jessica3619',
 'michael98003048',
 'shawn7232',
 'desley3692',
 'heena5717',
 'isabella78633723',
 'donna5417',
 'jess9423',
 'jacquesandjudy3659',
 'wall1224',
 'ken5708',
 'friedrich8811',
 'emily3361',
 'sarah3421',
 'anthony7816',
 'larchres',
 'rotaryclubofdesmoine5721',
 'emma8443',
 'glen007',
 'michael8613',
 'ashifa7656',
 'douglas5000',
 'joann3035',
 'vic5854',
 'rm99',
 'celia9481',
 'martinisaksen',
 'melanie9531',
 'hannu8440',
 'hugo7632',
 'steve2304',
 'ashish3752',
 'louis3454',
 'anchi',
 'scott8439',
 'travisbewick',
 'tracy2872',
 'mikael7391',
 'iain6538',
 'rebecca5768',
 'leosona9677',
 'chandra2797',
 'david50514998',
 'martin7609',
 'nicola8623',
 'bobette9723',
 'ed9492',
 'andrew2954',
 'joelcalhoun',
 'danny3973',
 'gerhard7529',
 'kitchenerwestmount6111',
 'jennifer5403',
 'danny6294',
 'deborah32085811',
 'james5183',
 'andrew5478',
 'nick4081',
 'gilles5665',
 'marisa6544',
 'nufs1399921',
 'alice7423',
 'greg3958',
 'isabelle1050',
 'trish9096',
 'JohnDurovsik',
 'kim1246',
 'lberwynlarson',
 'simplestepsit',
 'maria2236',
 'ellen9038',
 'natalie9978',
 'paul3490',
 'brinder7066',
 'kit',
 'webmarketingworkshop9003',
 'ingrid5161',
 'nat9955',
 'karen75059335',
 'karri3475',
 'rhys5540',
 'jan4822',
 'brian8446',
 'alblazek',
 'cliffordandtrish6392',
 'virginia5948',
 'judith1291',
 'juliannaandcarlos2726',
 'marianne7194',
 'christopher2561',
 'karen3859',
 'mohan1876',
 'jahanah2016',
 'oliver7977',
 'robby3834',
 'chris3576',
 'meldan8811',
 'TheIndependenceGroup',
 'eddie9065',
 'ross2273',
 'rachel8871',
 'stephen67196873',
 'thediesfamily3440',
 'riddhi6581',
 'anja2169',
 'james33089638',
 'mariebob8598',
 'ted4940',
 'alex7902',
 'brightonfumc5297',
 'james5860',
 'nick16871514',
 'ashkun',
 'brenda7153',
 'lilliam4565',
 'phil1705',
 'thegivingtree3561',
 'mark2151',
 'dave8598',
 'eleonora8899',
 'jennifer1619',
 'susanne3690',
 'dana3224',
 'maureen6748',
 'tim6879',
 'andreaandwouter6544',
 'robert5049',
 'gregory2085',
 'patricia6703',
 'donald2681',
 'dennis2118',
 'jen4479',
 'daniel8923',
 'billsue1282',
 'david27255219',
 'robert93921540',
 'elisabeth1763',
 'mike2188',
 'bhavin8147',
 'ted1103',
 'josiahandjenelle1526',
 'amandaandjames6424',
 'john6554',
 'hellehaubo3480',
 'bihs',
 'john47161280',
 'john9837',
 'billyrayvalentine',
 'william1853',
 'carolyn8911',
 'robert9390',
 'mpeachey',
 'rakesh2188',
 'korkenzieher',
 'arnold2472',
 'kai5350',
 'mark91758344',
 'hellebore',
 'irma5060',
 'peter1022',
 'virginiaandian5323',
 'peter9725',
 'barbara3168',
 'kris4542',
 'rebecca1905',
 'steve7366',
 'scott2640',
 'jasdeep5858',
 'chrisridley',
 'compadres9375',
 'ale2992',
 'ian3779',
 'stephanie80879541',
 'joonas6980',
 'jared2391',
 'michielvs',
 'freqflyercoll',
 'kathryn7184',
 'kandn5361',
 'homerkachemakbayrota4965',
 'barbara4996',
 'harrybray',
 'cayley6998',
 'sue4417',
 'michael3145',
 'dave8728',
 'louis3175',
 'shannon3211',
 'lonnie1660',
 'david1195',
 'patricia29798057',
 'matt5061',
 'jill7954',
 'mattiaslaven',
 'geoff2253',
 'paul8896',
 'katrin2380',
 'JRMorris',
 'nonprofittech',
 'cornelia4161',
 'robert1540',
 'rasmund',
 'brian9877',
 'fusis',
 'matt5385',
 'goncalo2244',
 'sterling2773',
 'blas8451',
 'floeckchen4420',
 'laura1901',
 'janis8871',
 'michelle8983',
 'david5344',
 'jason37861411',
 'simon2264',
 'MotivatePeople',
 'marek4750',
 'joann7884',
 'luigi9308',
 'mariajose8537',
 'robert5829',
 'katherine3037',
 'annandted4662',
 'suresh6523',
 'catherine1959',
 'david22052775',
 'john23817158',
 'debra5603',
 'robert6923',
 'ekram2969',
 'tauel6150',
 'candace3929',
 'maude6519',
 'alison3592',
 'laura3542',
 'mohsenmirza',
 'william71289474',
 'asim3780',
 'jubailbondurant',
 'al8509',
 'derek7086',
 'jackie1975',
 'laura6918',
 'nicholas4296',
 'janice39812803',
 'tomandjosette4280',
 'shana4099',
 'phillevo7016',
 'daz',
 'p2psybilgibson',
 'richard4816',
 'jamie9210',
 'lorne2645',
 'rob8096',
 'moose6619',
 'molly5796',
 'nancy9625',
 'klauskarlheinz9712',
 'lukekim',
 'gail5435',
 'matthew5251',
 'ronald6355',
 'bearcat',
 'anita2927',
 'torben1655',
 'annw9506',
 'ferg3675',
 'erikdavid5373',
 'kathy1014',
 'marco9703',
 'rotaryclubofkorea1918',
 'thomas3583',
 'terri1283',
 'boris9786',
 'belinda1180',
 'rami4499',
 'bjorn4894',
 'dalit4978',
 'richard9025',
 'loree6626',
 'emily707',
 'matthias8733',
 'nicola7221',
 'kennethandevelyn',
 'rinatchris',
 'rebecca49597714',
 'daniel8565',
 'jenniferd2199',
 'bruce29948793',
 'wali',
 'nummerupplysningense9484',
 'amrish7261',
 'judith8536',
 'kay7243',
 'wendy4029',
 'courtney9302',
 'heather7241',
 'annemarieandstefan9783',
 'aaronplaat',
 'svetlana8063',
 'william2536',
 'ryck2688',
 'david82172754',
 'nicole9629',
 'david1303',
 'patpatterson',
 'livio4294',
 'alistair8793',
 'alexship',
 'glenn6244',
 'jennifer8474',
 'kmix',
 'paul5763',
 'jeremy7007',
 'steven8748',
 'clem10',
 'bridgid9736',
 'joe7094',
 'john4190',
 'francisco6569',
 'christopher7826',
 'april2817',
 'patty7753',
 'nyla8831',
 'supheakmungkol',
 'smallpotatoes',
 'andreasundsandra',
 'southbees',
 'heather46185905',
 'joeboyib',
 'kimberly3205',
 'raghavendra8271',
 'jeff74386425',
 'trevor9044',
 'chris8267',
 'kenneth3135',
 'carl6659',
 'chris6162',
 'PreethaSrini',
 'joel7474',
 'brett5260',
 'patricia5673',
 'jim5307',
 'galent',
 'paul7323',
 'gnter7764',
 'zwanda',
 'jacqueline8828',
 'alex83857974',
 'jim4776',
 'paul1101',
 'kaylee8596',
 'evelyn1791',
 'mitchell9151',
 'mallory8446',
 'rotarysunrise2900',
 'bruce9526',
 'stephen1445',
 'ericevecedareden1449',
 'anita6984',
 'rich8185',
 'christian26584595',
 'wwahammy',
 'trevor4834',
 'john3968',
 'erin4301',
 'bettyjean7709',
 'brennans',
 'jeff5104',
 'david1820',
 'mialisa1413',
 'raphael5802',
 'john9402',
 'kirstin6090',
 'theodore4375',
 'paul6208',
 'gary4715',
 'joeprogram',
 'alison2128',
 'david3989',
 'dony4263',
 'peter1693',
 'bjrn4754',
 'lady1199',
 'millicent8178',
 'degi2142',
 'rich4990',
 'domenic3461',
 'david5920',
 'cheryl4200',
 'lieke3003',
 'cathianne8063',
 'joy3889',
 'megan3225',
 'Emily222',
 'peter7385',
 'gsdean',
 'christian3503',
 'salman',
 'thomas8140',
 'asaph9278',
 'rupert3346',
 'digyoursoul',
 'lisa2757',
 'david4731',
 'lynn2355',
 'david5298',
 'ricardo2012',
 'jonathan5106',
 'tonyzimney',
 'boris4328',
 'philip6173',
 'marniandterry6002',
 'maggie4805',
 'ida8887',
 'daveandjen',
 'linda8069',
 'heather20755236',
 'janet4297',
 'lee8693',
 'michael6148',
 'robbie5397',
 'rebecca3581',
 'jager',
 'kim6513',
 'martha3237',
 'FrequentMiler',
 'randy5533',
 'don5974',
 'kathleen1058',
 '9678',
 'antonia1758',
 'kjell1336',
 'everyvoicecounts8616',
 'carolyn8576',
 'dantheurer',
 'kyle4714',
 'linda2498',
 'olivier5387',
 'aneesh8680',
 'gary6885',
 'desmond9652',
 'michael1414',
 'jon3139',
 'bernie8425',
 'girish7183',
 'romin3340',
 'pat2528',
 'christopher4445',
 'daisy9157',
 'amir6469',
 'john2903',
 'john89205600',
 'uriel1963',
 'don7844',
 'liam4316',
 'jave5079',
 'riccardo5143',
 'rodandlin6599',
 'scott1314',
 'joanne92208822',
 'steve5533',
 'adrian5648',
 'thegbgfoundation2590',
 'marcus2309',
 'tracey82196304',
 'frederico5761',
 'hugues4782',
 'beth6695',
 'dwight1287',
 'vivekjois',
 'ronn5114',
 'gayle1434',
 'susan2215',
 'morphball678',
 'keith2250',
 'natalie4232',
 'terry9343',
 'sharie2937',
 'david46795129',
 'mikko5545',
 'frode1997',
 'marcy7409',
 'aaron6373',
 'tgilbert',
 'punahou8027',
 'werner6852',
 'steven37554850',
 'BEARCREEKNHS',
 'dalmulder',
 'fa8594',
 'vincenzo4952',
 'kara3683',
 'david7730',
 'bob18645868',
 'garonjones',
 'doris6402',
 'louis1251',
 'ryo9238',
 'rodney4129',
 'torbjorn3475',
 'katherine2882',
 'simon8668',
 'rburhum',
 'melissa3516',
 'torsten9544',
 'shinjiro5982',
 'roman9549',
 'duck3957',
 'rick9633',
 'klaus4519',
 'jeffgardner',
 'jennell',
 'abazar',
 'stephen1838',
 'mrcmrc',
 'daleanddave4907',
 'lynn5995',
 'antivir',
 'peter7648',
 'margreet5496',
 'cherise3060',
 'james58591619',
 'the5270',
 'joyce5432',
 'marlino8374',
 'goran1195',
 'richard7240',
 'carol7893',
 'stuart8188',
 'rose6016',
 'nawshaba5235',
 'kenneth2064',
 'katja9017',
 'siferyerson',
 'yolanda5524',
 'judith22792921',
 'jan1583',
 'eric2144',
 'epatel',
 'chandra6501',
 'peter50773497',
 'paul8834',
 'ashaka6856',
 'dudley8758',
 'maj5729',
 'gene4064',
 'stephen2817',
 'thomas6667',
 'clare7614',
 'angelea',
 'martin7285',
 'tjcioffe',
 'linda9342',
 'james6041',
 'gpg5402',
 'adrian8038',
 'karenandrew1324',
 'bobandsharon9979',
 'anna4670',
 'amandapena',
 'william3843',
 'diane4355',
 'stromhaltig',
 'joshua2492',
 'pandini',
 'bill6784',
 'joana2302',
 'geeta7488',
 'angel23006280',
 'iancutcher',
 'barbara9829',
 'john1996',
 'alison9646',
 'sharon19128868',
 'greg3912',
 'fandango3275',
 'brian9173',
 'erin9079',
 'gregory6989',
 'anna8507',
 'jessica32704686',
 'thanos1740',
 'cotera',
 'dirk2298',
 'kitty8916',
 'will4427',
 'gary1201',
 'swind',
 'curtis6458',
 'colleenandbill2422',
 'stephanie9731',
 'trevor2628',
 'john4688',
 'gary3141',
 'konrad6740',
 'robert9728',
 'francis5462',
 'gary4989',
 'camilla2376',
 'kevin9874',
 'kristen9457',
 'jim77224211',
 'idamayogkjetil5802',
 'nancy5888',
 'brian5392',
 'luisella2363',
 'ak1660',
 'rob1589',
 'jeanne5500',
 'shyam6842',
 'subbarao',
 'jennifer1899',
 'phillip9380',
 'jaume1191',
 'kyle3916',
 'alan2641',
 'patrick9876',
 'fabio1365',
 'marc7883',
 'katelyn8656',
 'steve2501',
 'marjana6954',
 'nancy32695280',
 'linda1271',
 'iain4702',
 'patrick3232',
 'scott5958',
 'goran9415',
 'elaine6268',
 'lena9048',
 'pamela7624',
 'ed4717',
 'mike7077',
 'wisser',
 'robert18704399',
 'emanuela5168',
 'youngshin7450',
 'howard3769',
 'samuel6127',
 'xina',
 'valerie1638',
 'eleanora7161',
 'lucy8572',
 'gnatterjack',
 'sandy8972',
 'elizabeth9543',
 'ryan2265',
 'karinhermann8282',
 'barbara96736433',
 'angus1534',
 'charles5280',
 'david3721',
 'jimkristinlucia7600',
 'em4059',
 'richard7856',
 'powerseedcanada',
 'ioannis4301',
 'caroline7859',
 'josh2179',
 'doug86838306',
 'zulfikarali5625',
 'maureen9992',
 'richard45357636',
 'jacob2296',
 'sabine6022',
 'VoltairesOptimism',
 'amy1848',
 'louise1113',
 'radha6945',
 'sarahsfast',
 'wd4603',
 'riekie7852',
 'bookfanatic',
 'mjoelner',
 'kristyn3371',
 'ashutosh',
 'kimjcipenticton9269',
 'catalina8451',
 'ryan1637',
 'susan91956614',
 'carlas2117',
 'allan2889',
 'joy3961',
 'donna49324963',
 'henk2143',
 'william4737',
 'matthieu3627',
 'crilla',
 'andrew1107',
 'theresa9744',
 'lori5377',
 'laurence9054',
 'bjorn9630',
 'edward3483',
 'jericho6075',
 'scottdonna1827',
 'annetta9999',
 'jahongir6641',
 'lorna8915',
 'martin5969',
 'emeianmadpnsmadp',
 'clare9811',
 'amanda7131',
 'peter6219',
 'jmehta4kiva',
 'craig4060',
 'karen6436',
 'christine6421',
 'timothy3676',
 'joseph2708',
 'jesperF',
 'grace3427',
 'and659237',
 'yves6524',
 'candace2567',
 'eric2352',
 'aisyear93888',
 'mats5491',
 'martin4961',
 'diana2377',
 'rubencuevasnieto',
 'markus1217',
 'gautam9529',
 'chris3706',
 'sean9654',
 'sweetmustache',
 'Gallifante',
 'ellisedwards',
 'jeannine2366',
 'barry1295',
 'nick3989',
 'mrsmoores8505',
 'patrick3785',
 'alycia6842',
 'emma4393',
 'linda5575',
 'shinichi3306',
 'marylou9429',
 'harue3480',
 'shawn2186',
 'jean6938',
 'todd6525',
 'caillin2323',
 'lee6682',
 'dlb',
 'scott9170',
 'berkaux',
 'paulo8531',
 'rhonda6343',
 'brendan7736',
 'kris1974',
 'reachdp',
 'scottinsideout',
 'diane9450',
 'chris5747',
 'sudds',
 'nadia4700',
 'dana6278',
 'kevinandangela',
 'carina7653',
 'thinkgladfish',
 'christiane3175',
 'jehangir6557',
 'ralph1078',
 'arthur4689',
 'healourworldproject',
 'joel7202',
 'hilary3717',
 'darshak7614',
 'trudi1628',
 'marc9703',
 'kenandbetsy5820',
 'haven9682',
 'jerryandlinda1820',
 'jenny2109',
 'steven76214840',
 'janet7989',
 'patrick6980',
 'wietske2941',
 'linda6670',
 'susan4516',
 'william7915',
 'richard92937960',
 'nic8922',
 'barbara6944',
 'hoteladriarkbookc5324',
 'richard6268',
 'kurt1776',
 'daniela2801',
 'ray4508',
 'anders1125',
 'kathleen4234',
 'nathan7007',
 'mikelola1456',
 'zengarten',
 'nick90044069',
 'ruiavelarsilva',
 'jeffchou',
 'tenille6377',
 'ogarankograndchildre2060',
 'frank8033',
 'ruperte',
 'verena83363574',
 'hugh8671',
 'thecampbellclan7609',
 'hamish8487',
 'kim4236',
 'lt6181',
 'margaret2864',
 'gary2223',
 'sara4314',
 'sharon2014',
 'phillip4141',
 'dianne8331',
 'maziqbal',
 'ryanreif',
 'paulkavitz',
 'eric8145',
 'ian9933',
 'tkane1973',
 'lawrence3458',
 'thomas34739359',
 'karen8113',
 'priyank3568',
 'peter5548',
 'spiro1850',
 'stingatfuchsia',
 'jeff8846',
 'angela7114',
 'investinpeople',
 'thomas9998',
 'kenya8758',
 'john6639',
 'benjayme6063',
 'p2pwomensfund',
 ...]

**4.** For each country, compute how many loans have involved that country as borrowers.

- This solution is based on panda grouping:

In [18]:
import time as tm
start_time = tm.time()
loans_count = loans.groupby(['country_code','country_name'], as_index=False)[['loan_id']].count()
loans_count.columns = ['country_code','country_name','loan_id_count']
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_count

--- 0.005003690719604492 seconds ---

   country_code            country_name  loan_id_count
0            AF             Afghanistan             12
1            AL                 Albania             50
2            AM                 Armenia            212
3            AZ              Azerbaijan            109
4            BA  Bosnia and Herzegovina              1
..          ...                     ...            ...
73           XK                  Kosovo             51
74           YE                   Yemen             88
75           ZA            South Africa             16
76           ZM                  Zambia             18
77           ZW                Zimbabwe             91

[78 rows x 3 columns]

**5.** For each country, compute the overall amount of money borrowed.

- This solution is based on panda grouping:

In [17]:
import time as tm
start_time = tm.time()
loans_sum = loans.groupby(['country_code','country_name'], as_index = False)[['loan_amount']].sum()
loans_sum.columns = ['country_code','country_name','loan_amount_sum']
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_sum

--- 0.013041973114013672 seconds ---

   country_code            country_name  loan_amount_sum
0            AF             Afghanistan          11625.0
1            AL                 Albania          69800.0
2            AM                 Armenia         371075.0
3            AZ              Azerbaijan         205675.0
4            BA  Bosnia and Herzegovina            575.0
..          ...                     ...              ...
73           XK                  Kosovo          74950.0
74           YE                   Yemen          92100.0
75           ZA            South Africa          29000.0
76           ZM                  Zambia          32650.0
77           ZW                Zimbabwe          92700.0

[78 rows x 3 columns]

**6.** Like the previous point, but expressed as a percentage of the overall amount lent.

- This solution is based on panda functions:

In [20]:
import time as tm
start_time = tm.time()
loans_total = loans['loan_amount'].sum()
loans_percent = loans.groupby(['country_code','country_name'], as_index = False)[['loan_amount']].sum()
loans_percent.columns = ['country_code','country_name','loan_amount_sum']
loans_percent['percent'] = loans_percent['loan_amount_sum']/loans_total*100
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_percent

--- 0.00758671760559082 seconds ---

   country_code            country_name  loan_amount_sum   percent
0            AF             Afghanistan          11625.0  0.069063
1            AL                 Albania          69800.0  0.414677
2            AM                 Armenia         371075.0  2.204531
3            AZ              Azerbaijan         205675.0  1.221901
4            BA  Bosnia and Herzegovina            575.0  0.003416
..          ...                     ...              ...       ...
73           XK                  Kosovo          74950.0  0.445273
74           YE                   Yemen          92100.0  0.547160
75           ZA            South Africa          29000.0  0.172287
76           ZM                  Zambia          32650.0  0.193971
77           ZW                Zimbabwe          92700.0  0.550724

[78 rows x 4 columns]

**7.** Like the three previous points, but split for each year (with respect to `disburse time`).

- This solution is based on panda functions:

In [25]:
import time as tm
start_time = tm.time()
from datetime import datetime as dt
loans_total = loans['loan_amount'].sum()
loans['disburse_time_year'] = None
for index, row in loans.iterrows():
    try:
        y = dt.strptime(row['disburse_time'], "%Y-%m-%d %H:%M:%S.%f %z").year
    except ValueError:
        y = None
    loans.loc[index,'disburse_time_year'] = y 
loans_agg = loans.groupby(['country_code','country_name','disburse_time_year'], as_index = False).agg({'loan_id':['count'],'loan_amount':['sum', lambda x: x.sum()/loans_total*100]})
loans_agg.columns = ['country_code','country_name','disburse_time_year','loan_id_count','loan_amount_sum','loan_amount_percent']
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_agg

--- 17.840534687042236 seconds ---

,country_code,country_name,disburse_time_year,loan_count,loan_sum,loan_percent
0,AF,Afghanistan,2009,11,10450.0,0.062083
1,AF,Afghanistan,2010,1,1175.0,0.006981
2,AL,Albania,2012,5,4250.0,0.025249
3,AL,Albania,2013,15,19150.0,0.113769
4,AL,Albania,2014,16,27225.0,0.161742
...,...,...,...,...,...,...
514,ZW,Zimbabwe,2013,9,16450.0,0.097728
515,ZW,Zimbabwe,2014,47,31200.0,0.185357
516,ZW,Zimbabwe,2015,9,9150.0,0.054360
517,ZW,Zimbabwe,2016,7,8950.0,0.053171
518,ZW,Zimbabwe,2017,12,13300.0,0.079014

**8.** For each lender, compute the overall amount of money lent. For each loan that has more than one lender, you must assume that all lenders contributed the same amount.

- This solution is based on panda functions:

In [45]:
import time as tm
start_time = tm.time()
merged = pd.merge(left=loans_lender,right=loans, left_on='loan_id', right_on='loan_id')
merged = merged[['loan_id','lender', 'loan_amount']]
number_of_lenders_by_loan_id = merged.groupby(['loan_id'], as_index = False)[['lender']].count()
number_of_lenders_by_loan_id
merged2 = pd.merge(left=merged,right=number_of_lenders_by_loan_id, left_on='loan_id', right_on='loan_id')
merged2['precise_amount'] = merged2.loan_amount / merged2.lender_y
merged2
lent_by_lender = merged2.groupby(['lender_x'], as_index = False)[['precise_amount']].sum()
print("--- %s seconds ---" % (tm.time()-start_time)) 
lent_by_lender
#result.loc[result['lender_x'] == 'muc888'] # result for one lender

--- 0.12060928344726562 seconds ---

                lender_x  precise_amount
0      100ofhumanity1199       64.583333
1             10yearitch       33.876812
2                 123321      153.990193
3           1ghostorchid       31.097561
4               1nottus1       43.750000
...                  ...             ...
19663         zubair1627       41.233766
19664              zubin      104.088235
19665               zuzu       25.714286
19666               zxdr       32.500000
19667           zzmcfate      196.912312

[19668 rows x 2 columns]

**9.** For each country, compute the difference between the overall amount of money lent and the overall amount of money borrowed. Since the country of the lender is often unknown, you can assume that the true distribution among the countries is the same as the one computed from the rows where the country is known.

In [46]:
import pandas as pd
import numpy as np
import time as tm
start_time = tm.time()
lenders = pd.read_csv('../../Datasets/kiva/lenders.csv')
if not FINAL:
    lenders = lenders.head(20000) 
lender_states = lenders[['permanent_name','country_code']]
lender_states

           permanent_name country_code
0                qian3013          NaN
1               reena6733          NaN
2                 mai5982          NaN
3          andrew86079135          NaN
4              nguyen6962          NaN
...                   ...          ...
19995         mohamed4338          NaN
19996  vicrennaisance8567          NaN
19997           mariz6787          NaN
19998          julian2868          NaN
19999         lestine1570          NaN

[20000 rows x 2 columns]

In [47]:
lenders_in_states = lender_states.loc[lender_states['country_code'].notnull()]
lenders_in_states

          permanent_name country_code
16            naresh2074           US
31     christina27976796           US
37             vikas1098           IN
39              qian1385           US
42              xigg8769           US
...                  ...          ...
19979        manrike5051           LA
19981         janell3482           US
19984         sheryl2462           US
19989            amy5291           US
19993          gokul8235           US

[3424 rows x 2 columns]

In [48]:
lenders_without_states = lender_states.loc[lender_states['country_code'].isnull()]
lenders_without_states

           permanent_name country_code
0                qian3013          NaN
1               reena6733          NaN
2                 mai5982          NaN
3          andrew86079135          NaN
4              nguyen6962          NaN
...                   ...          ...
19995         mohamed4338          NaN
19996  vicrennaisance8567          NaN
19997           mariz6787          NaN
19998          julian2868          NaN
19999         lestine1570          NaN

[16576 rows x 2 columns]

In [49]:
lent_and_state = pd.merge(left=lent_by_lender, right=lenders_in_states, left_on='lender_x', right_on='permanent_name')
lent_total = lent_and_state['precise_amount'].sum()
lent_by_state = lent_and_state.groupby(['country_code'], as_index = False).agg({'precise_amount':['count', 'sum', lambda x: x.sum()/lent_total]})
lent_by_state.columns = ['country_code', 'lent_count', 'lent_sum', 'lent_factor']
lent_by_state

  country_code  lent_count   lent_sum  lent_factor
0           AU           1  33.333333     0.431034
1           US           1  44.000000     0.568966

In [50]:
lent_no_state = pd.merge(left=lent_by_lender, right=lenders_without_states, left_on='lender_x', right_on='permanent_name')
lent_no_state_total = lent_no_state['precise_amount'].sum()
lent_no_state_total

305.0

In [51]:
lent_by_state['additional_lent'] = lent_by_state.lent_factor * lent_no_state_total
lent_by_state

  country_code  lent_count   lent_sum  lent_factor  additional_lent
0           AU           1  33.333333     0.431034       131.465517
1           US           1  44.000000     0.568966       173.534483

In [52]:
loan_and_state = loans[['loan_id','country_code','loan_amount']]
loan_and_state

       loan_id country_code  loan_amount
0       657307           PH        125.0
1       657259           HN        400.0
2       658010           PK        400.0
3       659347           KG        625.0
4       656933           PH        425.0
...        ...          ...          ...
19995   341198           NI        375.0
19996   341771           PH        175.0
19997   344237           MX        625.0
19998   344735           SV        350.0
19999   345313           KE        100.0

[20000 rows x 3 columns]

In [53]:
loan_by_state = loan_and_state.groupby(['country_code'], as_index = False).agg({'loan_amount':['sum']})
loan_by_state.columns = ['country_code','loan_amount_sum']
loan_by_state

   country_code  loan_amount_sum
0            AF          11625.0
1            AL          69800.0
2            AM         371075.0
3            AZ         205675.0
4            BA            575.0
..          ...              ...
73           XK          74950.0
74           YE          92100.0
75           ZA          29000.0
76           ZM          32650.0
77           ZW          92700.0

[78 rows x 2 columns]

In [57]:
loan_and_lent = pd.merge(loan_by_state, lent_by_state, how='left', on=['country_code'])
loan_and_lent['result'] = loan_and_lent.loan_amount_sum - loan_and_lent.lent_sum - loan_and_lent.additional_lent 
print("--- %s seconds ---" % (tm.time()-start_time)) 
loan_and_lent[loan_and_lent.result == loan_and_lent.result.max()]

--- 587.6020474433899 seconds ---

,country_code,loan_amount_sum,lent_count,lent_sum,lent_factor,additional_lent,result
70,US,294625.0,1.0,44.0,0.568966,173.534483,294407.465517

**10.** Which country has the highest ratio between the difference computed at the previous point and the population?

**11.** Which country has the highest ratio between the difference computed at point 9 and the population that is not below the poverty line?

**12.** For each year, compute the total amount of loans. Each loan that has planned expiration time and disburse time in different years must have its amount distributed proportionally to the number of days in each year. For example, a loan with disburse time December 1st, 2016, planned expiration time January 30th 2018, and amount 5000USD has an amount of 5000USD * 31 / (31+365+30) = 363.85 for 2016, 5000USD * 365 / (31+365+30) = 4284.04 for 2017, and 5000USD * 30 / (31+365+30) = 352.11 for 2018.